flying4fun/ESP8266_APA102_chair/src/main.cpp
void colorbands() {
  if (bWipe == 1) {
    //movingled = 0;
    black();
    bWipe = 0;
    //bBounce = 0;
  }

  if (bBounce == 0) {
    leds[movingled] = CHSV(gHue, gSat, 255);
    movingled++;
    if (movingled == (NUM_LEDS - 1)) {
      gHue = random8();
      gSat = random8(160, 255);
      bBounce = 1;
    }
  }
  // Now go in the other direction.
  //if ((movingled > 0) && (bBounce == 1)) {
  else {
    leds[movingled] = CHSV(gHue, gSat, 255);
    movingled--;
    if (movingled == 0) {
      gHue = random8();
      gSat = random8(160, 255);
      bBounce = 0;
    }
  }
} // colorbands()


void bouncingball() {

  if (bBounce == 0) {
    fadeall();
    leds[movingled] = CHSV(gHue, 255, 255);
    if (movingled > 0) {
      leds[movingled - 1] = CRGB::Black;
    }
    movingled++;
    if (movingled == (NUM_LEDS - 1)) {
      gHue = random8();
      //gSat = random8(160, 255);
      bBounce = 1;
    }
  }
  // Reverse
  else {
    fadeall();
    leds[movingled] = CHSV(gHue, 255, 255);
    if (movingled < (NUM_LEDS - 1)) {
      leds[movingled + 1] = CRGB::Black;
    }
    movingled--;
    if (movingled == 0) {
      gHue = random8();
      //gSat = random8(160, 255);
      bBounce = 0;
    }
  }
} // bouncingball()


void snakey() {
  if (bWipe == 1) {                                             // wipe the display at pattern startup
    black();
    bWipe = 0;
  }

  if (bBounce == 0) {
    leds[movingled] = CHSV(gHue++, 255, 255);
    movingled++;
    if (movingled == (NUM_LEDS - 1)) {
      bBounce = 1;
    }
  }
  // Reverse
  else {
    leds[movingled] = CHSV(gHue++, 255, 255);
    movingled--;
    if (movingled == 0) {
      bBounce = 0;
    }
  }
  fadeall();
} // snakey()


void bpm() {                                                  // Colored stripes pulsing at a defined Beats-Per-Minute.

  uint8_t BeatsPerMinute = 60;
  CRGBPalette16 palette = PartyColors_p;
  uint8_t beat = beatsin8(BeatsPerMinute, 64, 255);
  EVERY_N_MILLISECONDS(20) {                                  // slowly cycle the "base color" through the rainbow
    gHue++;
  }
  for (int i = 0; i < NUM_LEDS; i++) { //9948
    leds[i] = ColorFromPalette(palette, gHue + (i * 2), beat - gHue + (i * 10));
  }

} // bpm()


void blipouts() {
  uint8_t blipWidth = NUM_LEDS/30;                              // larger number = smaller width blips

  if (bWipe == 1) {                                             // wipe the display
    black();
    bWipe = 0;
  }

  fadeall();
  if (bBounce == 1) {
    EVERY_N_MILLISECONDS(50) {                                  // we always wait for a blip to finish, but if done early, this is the minimum time before next blip
      bBounce = 0;
      gBrt = 255;
      gSat++;                                                   // borrowing the unused (in this effect) gSat variable for rotation of color wheel
      gHue = (gSat + random8(40));                              // randomize the displayed hue by 40
      movingled = random16(NUM_LEDS);
      movingledB = movingled;
      movingledC = movingled;
      leds[movingled] = CHSV(gHue, 255, gBrt);
    }
  }
  if (gBrt > (255/blipWidth)) {
    gBrt -= (255/blipWidth);
  }
  if (movingledB < (NUM_LEDS - 2)) {
    if (movingledB < (movingled + blipWidth)) {
      movingledB++;
      leds[movingledB] = CHSV(gHue, 255, gBrt);
    } else {
      bBounce = 1;
    }
  }
  if (movingledC > 0) {
    if (movingledC > (movingled - blipWidth)) {
      movingledC--;
      leds[movingledC] = CHSV(gHue, 255, gBrt);
    } else {
      bBounce = 1;
    }
  }
}


void fireball() {

  uint8_t i = 30;                      //chance of trailing sparkles 0-255
  int8_t j = 1;

  fadesparkle();

  if (bBounce == 0) {
    leds[movingled] = CRGB::Orange;
    //leds[movingled] = CHSV(gHue++, 255, 255);
    if (movingled > 0) {
      leds[movingled - 1].nscale8(80);
    }
    j+random8(5);
    if ((random8() < i) && ((movingled - j) >= 0)) {
      movingledB = (movingled - j);
      leds[ movingledB ] = CRGB::Tan;
    }
    movingled++;
    if (movingled == (NUM_LEDS-1)) {
      bBounce = 1;
    }
  }
  // Now go in the other direction.
  else {
    leds[movingled] = CRGB::Orange;
    //leds[movingled] = CHSV(gHue++, 255, 255);
    if (movingled < (NUM_LEDS - 1)) {
      leds[movingled + 1].nscale8(80);
    }
    j+random8(5);
    if ((random8() < i) && ((movingled + j) < NUM_LEDS)) {
      movingledB = (movingled + j);
      leds[ movingledB ] = CRGB::Tan;
    }
    movingled--;
    if (movingled == 0) {
      bBounce = 0;
    }
  }
} // fireball()



void juggle() {                                               // Eight colored dots, weaving in and out of sync with each other.

  fadeToBlackBy(leds, NUM_LEDS, 20);
  byte dothue = 0;

  for(int i = 0; i < 8; i++) {
    leds[beatsin16(i+7,0,(NUM_LEDS-1))] |= CHSV(dothue, 200, 255);
    dothue += 32;
  }
} // juggle()



void cylon() {
  uint8_t eyeSize = NUM_LEDS / 5;
  uint8_t tempBrt;
  gHue = 0;
  gSat = 255;
  gBrt = 255;
  tempBrt = gBrt;

  if ( bBounce == 0 ) {
    if((NUM_LEDS/50) > 1)
      movingled += (NUM_LEDS/50);
    else
      movingled++;
    if ( movingled >= (NUM_LEDS - 1) ) {
      bBounce = 1;
      movingled = (NUM_LEDS - 1);
    }
  } else {
    if((NUM_LEDS/50) > 1 )
      movingled -= (NUM_LEDS/50);
    else
      movingled--;
    if ( movingled <= 0 ) {
      bBounce = 0;
      movingled = 0;
    }
  }

  black();
  leds[movingled] = CHSV(gHue, gSat, gBrt);

  for( int i = movingled+1; i < (movingled+1)+(eyeSize/2); i++ ) {
    if( i < NUM_LEDS ) {
      tempBrt -= (gBrt/(eyeSize/2));
      leds[i] = CHSV(gHue, gSat, tempBrt);
    }
  }

  tempBrt = gBrt;
  for( int i = movingled-1; i > (movingled-1)-(eyeSize/2); i-- ) {
    if( i >= 0 ) {
      tempBrt -= (gBrt/(eyeSize/2));
      leds[i] = CHSV(gHue, gSat, tempBrt);
    }
  }
} // cylon



void landinglight() {
  uint8_t numStrobes = 30;                                      // how many strobes do you want?
  uint8_t spacing = (NUM_LEDS/numStrobes);
  if (spacing < 1) {
    spacing = 1;
  }
  if (bWipe == 1) {                                             // wipe the display at pattern startup
    black();
    bWipe = 0;
  }

  if (bBounce == 1) {
    black();
    EVERY_N_MILLISECONDS(500) {
      bBounce = 0;
      movingled = 0;
    }
  }

  if (bBounce == 0) {
    black();
    if (movingled < (NUM_LEDS - 1)) {
      leds[movingled] = CRGB::White;
      if ((movingled + spacing) < (NUM_LEDS - 1)) {
        movingled += spacing;
      } else {
        bBounce = 1;
      }
    }
  }
} // landinglight


void pulse() {

  if (bWipe == 1) {                                             // wipe the display
    black();
    bWipe = 0;
  }

  uint8_t BPM = 60;
  uint8_t beat = beatsin8(BPM, 0, 255);
  EVERY_N_MILLISECONDS(100) {
    gHue++;
  }
  if(DEBUG) { Serial.println(beat); }
  for (uint16_t i = 0; i <= ((NUM_LEDS)/2); i++) {
    leds[i] = CHSV(gHue, 255, ((i*beat)/NUM_LEDS)*2);
    leds[(NUM_LEDS-1) - i] = CHSV(gHue, 255, ((i*beat)/NUM_LEDS)*2);
  }
} // pulse()


